#include "func.h"

int x = 0;
int y = 0;
double f = 0;
char errors = 0;

int main(void){
set_chcp();

  /*---------------------------------------------------------------------------------------------------*/
 /*---------------------------------| Введення та перевірка x і y| ----------------------------------*/
/*---------------------------------------------------------------------------------------------------*/
do{
errors = 0;

	printf("\r\nДля обчислення введіть значення \"x\" та \"y\" \r\n");
		x = scanf_check_int('x');
		y = scanf_check_int('y');

  /*---------------------------------------------------------------------------------------------------*/
 /*---------------------| Перевірка чи можливо обчислити введені значення|----------------------------*/
/*---------------------------------------------------------------------------------------------------*/

	if (x*y < 1)
	{
		printf("\r\n Для заданих значень \"x\" та \"y\" у обчислюваному виразі виконується:\r\n Логарифмування числа, меншого за нуль\r\n");
		errors = 1;
		continue;

	} else  if (1+pow(x,2)+pow(y,2) == 0)
			{
				printf("\r\n Для заданих значень \"x\" та \"y\" у обчислюваному виразі виконується:\r\n Ділення на 0\r\n");
				errors = 1;
				continue;
			}

}while(errors == 1);

  /*---------------------------------------------------------------------------------------------------*/
 /*-------------------------| Обчислення та вивід на екран результату|--------------------------------*/
/*---------------------------------------------------------------------------------------------------*/


	f = (pow(x,2)+log2(x*y)-pow(y,2))/(1+pow(x,2)+pow(y,2));

	printf("\r\n*************************");
	printf("\r\nВведенні дані:\r\n\n");
	printf("\tx = %d\r\n", x);
	printf("\ty = %d\r\n", y);
	printf("\r\nВідповідь: f = %.2lf", f);
	printf("\r\n*************************\r\n");

		reset_chcp();
		return 0;
}
